{
  "title": "Cluster Search",
  "content": "\n            <div><div>\nThe indicator effectively analyzes cluster data (footprint). It boasts a wide range of customizable filters, allowing users to flexibly approach various market scenarios. The filters include settings for analyzing trade volumes, time frames, price levels, and other criteria, making it an ideal tool for identifying cluster patterns and optimizing trading strategies.\n</div>\n</div><hr><figure><img src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/72081507714/original/2Pr8YSn9nQITL6iZMu46xsuLBXGn1AMNqg.png?1705403780\"></figure><p>To add and set up the indicator, open the <a href=\"https://help.atas.net/en/support/solutions/articles/72000602613\">Indicators settings window</a>.</p><p><br></p><h2>Indicator's settings<em><br></em></h2><div><div>\n<h3>Filters</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Calculation Mode</td>\n<td>Calculation Mode of the Indicator <br><br><div>Options: <ul><li><b>Bids</b></li><li><b>Ask</b></li><li><b>Delta</b></li><li><b>Volume</b></li><li><b>Ticks</b></li><li><b>POC level</b></li></ul></div></td>\n</tr>\n<tr>\n<td>Autofilter</td>\n<td>Enables dynamic adjustment of the indicator's filters to suit a specified instrument. When the auto-filter is activated, the parameters for the maximum and minimum filters are disabled</td>\n</tr>\n<tr>\n<td>Minimum value</td>\n<td>Minimum Filter Value</td>\n</tr>\n<tr>\n<td>Maximum value</td>\n<td>Maximum Filter Value</td>\n</tr>\n<tr>\n<td>Minimum average trade</td>\n<td>This property is used to determine the minimum average trade required for a price level to be considered valid. The average trade is calculated by dividing the volume of a price level by the number of ticks on that level. If the resulting value is less than this property, the price level will be excluded from consideration.</td>\n</tr>\n<tr>\n<td>Maximum average trade</td>\n<td>This property is used to determine the maximum average trade required for a price level to be considered valid. The average trade is calculated by dividing the volume of a price level by the number of ticks on that level. If the resulting value is greater than this property, the price level will be excluded from consideration.</td>\n</tr>\n<tr>\n<td>Min Volume Percent</td>\n<td>Property is used to set the minimum volume percentage required for a price level to be considered valid. The volume percentage is calculated by dividing the volume of a price level by the total volume of the candle and multiplying by 100. If the resulting value is less than this property, the price level will be excluded from consideration. If the property is set to 0, it will not be used in the validation check.</td>\n</tr>\n<tr>\n<td>Max volume percent</td>\n<td>Property is used to set the maximum volume percentage allowed for a price level to be considered valid. The volume percentage is calculated by dividing the volume of a price level by the total volume of the candle and multiplying by 100. If the resulting value is greater than this property, the price level will be excluded from consideration. If the property is set to 0, it will not be used in the validation check.</td>\n</tr>\n</tbody></table>\n<h3>Delta Filters</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Bid Ask Imbalance,%</td>\n<td>This property is used to filter out price levels based on the difference between the percentage of ask volume and the percentage of bid volume. If the value is positive, the filter will only allow price levels where the percentage of ask volume is greater than or equal to the value. If the value is negative, the filter will only allow price levels where the percentage of bid volume is greater than or equal to the value.</td>\n</tr>\n<tr>\n<td>Delta filter</td>\n<td>This property is used to set a filter on the delta for a specific price level. If the value is positive, the filter will only allow price levels where the delta is greater than or equal to the value. If the value is negative, the filter will only allow price levels where the delta is less than or equal to the value.</td>\n</tr>\n</tbody></table>\n<h3>Location filters</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Candle direction</td>\n<td>Direction of the candle <br><br><div>Options: <ul><li><b>Bearish</b></li><li><b>Bullish</b></li><li><b>Any</b></li><li><b>Neutral</b></li></ul></div></td>\n</tr>\n<tr>\n<td>Bars range</td>\n<td>This property is used to specify the number of candles that should be aggregated before the main calculation takes place.</td>\n</tr>\n<tr>\n<td>Price range</td>\n<td>It determines the range of prices that will be aggregated in the calculation. The range is defined by the number of ticks specified in the parameter.</td>\n</tr>\n<tr>\n<td>Ticks from High</td>\n<td>This property sets the maximum distance in ticks from the candle's high price that a level can be considered as valid. If the distance between the level and the candle's high price exceeds the value of this property the level will not be considered as valid.</td>\n</tr>\n<tr>\n<td>Ticks from Low</td>\n<td>This property sets the maximum distance in ticks from the candle's low price that a level can be considered as valid. If the distance between the level and the candle's low price exceeds the value of this property the level will not be considered as valid.</td>\n</tr>\n<tr>\n<td>Price location</td>\n<td>Selecting the location of a cell with a value of a given type within the candle, which the indicator will take into account when searching <br><br><div>Options: <ul><li><b>At High</b></li><li><b>At Low</b></li><li><b>Any</b></li><li><b>Body</b></li><li><b>Upper wick</b></li><li><b>Lower wick</b></li><li><b>At High or Low</b></li><li><b>Any wick</b></li></ul></div></td>\n</tr>\n</tbody></table>\n<h3>Candle height</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Minimum candle height</td>\n<td>This parameter sets the minimum height of the candle (including wicks) required to trigger the indicator. If the height of a candle is below this value, the indicator will not apply to such a candle.</td>\n</tr>\n<tr>\n<td>Maximum candle height</td>\n<td>This parameter establishes the maximum permissible height of a candle (including wicks) for the indicator to be activated. Candles exceeding this height are ignored by the indicator.</td>\n</tr>\n<tr>\n<td>Minimum candle body height</td>\n<td>Determines the minimum height of the candle's body (the difference between the opening and closing prices) required for the indicator to be displayed on that candle. Candles with a body smaller than this size will not be marked by the indicator.</td>\n</tr>\n<tr>\n<td>Maximum candle body height</td>\n<td>Sets the maximum height of the candle's body at which the indicator will still be displayed. Candles with a body exceeding this value will be excluded from consideration by the indicator.</td>\n</tr>\n</tbody></table>\n<h3>Time filtration</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Use time filter</td>\n<td>This setting enables the application of a time-based filter for the indicator. When activated, the indicator will only analyze and display data for candles that fall within a specified time range. If turned off, the indicator considers candles from all time frames.</td>\n</tr>\n<tr>\n<td>Time from</td>\n<td>This parameter sets the starting time for the time filter.</td>\n</tr>\n<tr>\n<td>Time to</td>\n<td>This parameter establishes the end time for the time filter.</td>\n</tr>\n</tbody></table>\n<h3>Visualization</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Only one selection per bar</td>\n<td>This setting ensures that only one maximum selection is made per bar or candlestick.</td>\n</tr>\n<tr>\n<td>Visual Mode</td>\n<td>The visual mode setting determines how selections are displayed on the chart <br><br><div>Options: <ul><li><b>Ellipse</b></li><li><b>Triangle</b></li><li><b>Rectangle</b></li><li><b>Diamond</b></li><li><b>Only price</b></li></ul></div></td>\n</tr>\n<tr>\n<td>Objects color</td>\n<td>This setting allows users to customize the color of the visual objects on the chart.</td>\n</tr>\n<tr>\n<td>Visual Objects Transparency</td>\n<td>This setting allows users to customize transparency of the visual objects on the chart.</td>\n</tr>\n<tr>\n<td>Show price selection</td>\n<td>When enabled, this feature highlights price levels within clusters on the chart, making it easier to identify significant price points within selected volumes.</td>\n</tr>\n<tr>\n<td>Price selection color</td>\n<td>This setting lets users choose the color for highlighting the price selections within clusters, providing a visual distinction from other elements on the chart.</td>\n</tr>\n<tr>\n<td>Fixed Sizes</td>\n<td>When this option is turned on, all volumes will be displayed with a similar size, regardless of their actual volume. This can be useful for standardizing the visual representation of different volumes on the chart.</td>\n</tr>\n<tr>\n<td>Size</td>\n<td>This parameter sets the standard size for selections on the chart.</td>\n</tr>\n<tr>\n<td>Minimum Size</td>\n<td>Indicates the minimum size for the shape.</td>\n</tr>\n<tr>\n<td>Maximum Size</td>\n<td>Indicates the maximum size for the shape.</td>\n</tr>\n</tbody></table>\n<h3>Alerts</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Use alerts</td>\n<td>This setting enables alert notifications for specific conditions or events as defined by the indicator. When activated, the indicator will send an alert.</td>\n</tr>\n<tr>\n<td>Alert File</td>\n<td>This parameter allows users to specify the name of a custom audio file for alert sounds. Users can select a WAV file that will be played whenever an alert condition is triggered. The chosen WAV file should be located in the folder C:\\Program Files (x86)\\ATAS Platform\\Sounds.</td>\n</tr>\n<tr>\n<td>Background</td>\n<td>This option is used to set the background color of alert messages. It allows users to customize the appearance of the background for notifications or alerts generated by the indicator.</td>\n</tr>\n</tbody></table>\n<h3>Calculation</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Use Previous Close</td>\n<td>This setting controls when the indicator calculations are performed. When enabled, the indicator will only calculate and update its values once a bar is completely formed and closed.</td>\n</tr>\n<tr>\n<td>Days look back</td>\n<td>Refers to the number of previous days taken into account when calculating an indicator.</td>\n</tr>\n</tbody></table>\n</div>\n</div>\n            \n\n          ",
  "url": "https://help.atas.net/en/support/solutions/articles/72000602240-cluster-search",
  "scrapedAt": "2025-10-20T22:19:54.338Z"
}