{
  "title": "Big Trades",
  "content": "\n            <div><div>\nThe Big Trades indicator displays large market buys and sells (which are visible in Smart Tape) on the chart single, the so-called aggressive trades that are executed in large volume at once. You can choose what volume you want to see and adjust it by bids and asks in the indicator settings.<br>When installed, the indicator has default settings and these settings are not suitable for all instruments and time frames, so the indicator needs to be configured.<br>The maximum number of days that can be calculated by the indicator is one week. That is, if the chart contains 100 days, the indicator will only calculate the orders for the last week.<br><br>The Autofilter changes dynamically, but only at the time of the first run, it does not change online.<br>Autofilter may depend on the timeframe due to different number of days of history loaded by default. The indicator takes the last few days, and calculates aggregated orders. The filter is then chosen so that every day has about 10 splashes on the average. And if the indicator is only load for one day, it will consider the aggregated trades for the day and will display an average of ~10 splashes. If a week is loaded, the indicator will calculate orders for the week (including the current day) and will also display an average of ~10 splashes per day.\n</div>\n</div><hr><figure><p><br></p><img src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/72082193205/original/hUzwmI2Qflf-oKpiudG89XLgPWETqKJUvQ.png?1705776839\"></figure><p><br></p><p>To add and set up the indicator, open the <a href=\"https://help.atas.net/en/support/solutions/articles/72000602613\">Indicators settings window</a>.</p><p><br></p><h2>Indicator's settings<em><br></em></h2><div><div>\n<h3>Calculation</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Calculation Mode</td>\n<td>Calculation Mode of the Indicator <br><br><div>Options: <ul><li><b>Cumulative Trades</b></li><li><b>Separated trades</b></li></ul></div></td>\n</tr>\n<tr>\n<td>Price location</td>\n<td>Selecting the location of a cell with a value of a given type within the candle, which the indicator will take into account when searching <br><br><div>Options: <ul><li><b>At High</b></li><li><b>At Low</b></li><li><b>Any</b></li><li><b>Body</b></li><li><b>Upper wick</b></li><li><b>Lower wick</b></li><li><b>At High or Low</b></li></ul></div></td>\n</tr>\n<tr>\n<td>Autofilter</td>\n<td>This setting work only in cumulative mode.</td>\n</tr>\n<tr>\n<td>Minimum Volume</td>\n<td>Volumes that are less than the value set in this filter will be ignored.</td>\n</tr>\n<tr>\n<td>Maximum Volume</td>\n<td>Volumes greater than the value set in this filter will be ignored.</td>\n</tr>\n</tbody></table>\n<h3>Time filtration</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Use time filter</td>\n<td>This setting enables the application of a time-based filter for the indicator. When activated, the indicator will only analyze and display data for candles that fall within a specified time range. If turned off, the indicator considers candles from all time frames.</td>\n</tr>\n<tr>\n<td>Time from</td>\n<td>This parameter sets the starting time for the time filter.</td>\n</tr>\n<tr>\n<td>Time to</td>\n<td>This parameter establishes the end time for the time filter.</td>\n</tr>\n</tbody></table>\n<h3>Colors</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Buy Color</td>\n<td>Defines the color for the element displaying buy trades.</td>\n</tr>\n<tr>\n<td>Sell Color</td>\n<td>Defines the color for the element displaying sell trades.</td>\n</tr>\n<tr>\n<td>Between color</td>\n<td>Defines the color for elements displaying over-the-counter trades.</td>\n</tr>\n</tbody></table>\n<h3>Visualization</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Show above chart</td>\n<td>Determines whether the visual elements are drawn above or below the price data on a chart. When enabled, it overlays the indicator's graphics over the price plot.</td>\n</tr>\n<tr>\n<td>Visual Mode</td>\n<td>The visual mode setting determines how selections are displayed on the chart <br><br><div>Options: <ul><li><b>Ellipse</b></li><li><b>Triangle</b></li><li><b>Rectangle</b></li><li><b>Diamond</b></li><li><b>Only price</b></li></ul></div></td>\n</tr>\n<tr>\n<td>Visual Objects Transparency</td>\n<td>This setting allows users to customize transparency of the visual objects on the chart.</td>\n</tr>\n<tr>\n<td>Cluster Selection Transparency</td>\n<td>Similar to the visual objects transparency, this setting adjusts the transparency of highlighted elements within clusters, allowing for finer control over their visual appearance.</td>\n</tr>\n<tr>\n<td>Fixed Sizes</td>\n<td>When this option is turned on, all volumes will be displayed with a similar size, regardless of their actual volume. This can be useful for standardizing the visual representation of different volumes on the chart.</td>\n</tr>\n<tr>\n<td>Size</td>\n<td>This parameter sets the standard size for selections on the chart.</td>\n</tr>\n<tr>\n<td>Minimum Size</td>\n<td>Indicates the minimum size for the shape.</td>\n</tr>\n<tr>\n<td>Maximum Size</td>\n<td>Indicates the maximum size for the shape.</td>\n</tr>\n<tr>\n<td>Show value</td>\n<td>Determines whether to display volume information.</td>\n</tr>\n</tbody></table>\n<h3>Alerts</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Use alerts</td>\n<td>Enables or disables the sound notification.</td>\n</tr>\n<tr>\n<td>Alert File</td>\n<td>This parameter allows users to specify the name of a custom audio file for alert sounds. Users can select a WAV file that will be played whenever an alert condition is triggered. The chosen WAV file should be located in the folder C:\\Program Files (x86)\\ATAS Platform\\Sounds.</td>\n</tr>\n<tr>\n<td>Background</td>\n<td>This option is used to set the background color of alert messages. It allows users to customize the appearance of the background for notifications or alerts generated by the indicator.</td>\n</tr>\n</tbody></table>\n</div>\n</div><p><br></p><div><span><br>How Does the Autofilter in the Big Trades Indicator Work?</span></div><div><span><p>The Autofilter in the Big Trades indicator changes dynamically, but only at the time of the first run, it does not change online.</p><p><br></p><p>The Autofilter can depend on the timeframe. The indicator takes the last few days, and calculates aggregated orders. The filter is then chosen so that every day has about 10 splashes on the average. And if the indicator is only load for one day, it will consider the aggregated orders for the day and will display an average of ~10 splashes. If a week is loaded, the indicator will calculate orders for the week (including the current day) and will also display an average of ~10 splashes.</p><p><br></p><p>The maximum number of days that can be calculated by the indicator is one week. That is, if the chart contains 100 days, the indicator will only calculate the orders for the last week.</p></span></div>\n            \n\n          ",
  "url": "https://help.atas.net/en/support/solutions/articles/72000602332-big-trades",
  "scrapedAt": "2025-10-20T22:21:56.525Z"
}