{
  "title": "RTIndicator",
  "content": "\n            <div><div>\nA unique indicator that combines the range (size) and the trend (direction) of the market. It allows you to find the market reversal points. Indicator is recommended to be used on RangeX and RangeZ charts.<br>The algorithm of this indicator is closed by agreement with the author and it is available only in our platform. It is based on a neural network, a self-learning system, that combines the Range (size) and trend (direction) of the market. It allows you to find the area of a market reversal. An arrow differs from a dot by an additional filter. We recommend using RTIndicator in combination with various Range chart options.\n</div>\n</div><hr><p><img src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/72085304635/original/WAgIS-EhJi4SrdbyJdj5GRzr9F9APo6NGg.png?1707834814\"></p><p>To add and set up the indicator, open the <a href=\"https://help.atas.net/en/support/solutions/articles/72000602613\">Indicators settings window</a>.</p><p><br></p><h2>Indicator's settings<em><br></em></h2><div><div>\n<h3>Common</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Filter</td>\n<td>Defines the filter value for internal calculations.</td>\n</tr>\n<tr>\n<td>Autofilter</td>\n<td>If enabled, the autofilter is used for internal calculations, otherwise the filter specified in the settings is used.</td>\n</tr>\n<tr>\n<td>Source</td>\n<td>Allows the user to select the data source for calculating the indicator. It can be specific candlestick prices like open, close, etc., or another indicator</td>\n</tr>\n</tbody></table>\n<h3>Colors</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Buy Color</td>\n<td>Sets the color of the element representing the buy signal.</td>\n</tr>\n<tr>\n<td>Sell Color</td>\n<td>Sets the color of the element representing the sell signal.</td>\n</tr>\n</tbody></table>\n<h3>Alerts</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Use alerts</td>\n<td>Enables or disables the sound notification.</td>\n</tr>\n<tr>\n<td>Alert File</td>\n<td>This parameter allows users to specify the name of a custom audio file for alert sounds. Users can select a WAV file that will be played whenever an alert condition is triggered. The chosen WAV file should be located in the folder C:\\Program Files (x86)\\ATAS Platform\\Sounds.</td>\n</tr>\n<tr>\n<td>Background</td>\n<td>Sets the background color of the alert window.</td>\n</tr>\n</tbody></table>\n</div>\n</div>\n            \n\n          ",
  "url": "https://help.atas.net/en/support/solutions/articles/72000602460-rtindicator",
  "scrapedAt": "2025-10-20T22:24:37.647Z"
}