{
  "title": "Session Color",
  "content": "\n            <div><div>\nThe following indicator allows to highlight the background of the chart for a set period of time, cyclically, every trading day. For example, by setting a couple of such indicators with different setup, we can highlight the trading sessions of the main trading platforms, and visualize when they start, end, and intersect with each other. It may be important to consider this during the intraday trading, as during the opening and closing of a day, higher trading activity and instrument volatility is often observed.\n</div>\n</div><hr><figure><img src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/72077065581/original/XZvvTULyasW7rIOvbbai3JxoJITQzobuIQ.png\"></figure><p>To add and set up the indicator, open the <a href=\"https://help.atas.net/en/support/solutions/articles/72000602613\">Indicators settings window</a>.</p><p><br></p><h2>Indicator's settings<em><br></em></h2><div><div>\n<h3>Settings</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Show above chart</td>\n<td>Determines whether the visual elements are drawn above or below the price data on a chart. When enabled, it overlays the indicator's graphics over the price plot.</td>\n</tr>\n<tr>\n<td>Show area</td>\n<td>Determines whether to paint the specified area with the specified color.</td>\n</tr>\n<tr>\n<td>Area Color</td>\n<td>Sets the color for a specific area on the chart.</td>\n</tr>\n<tr>\n<td>Start time</td>\n<td>The start time of the trading platform</td>\n</tr>\n<tr>\n<td>End time</td>\n<td>The end time of the trading platform</td>\n</tr>\n</tbody></table>\n<h3>Alerts</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Open session</td>\n<td>If enabled, when opening a session an alert is generated with the specified sound file.</td>\n</tr>\n<tr>\n<td>Closing the session</td>\n<td>If enabled, when closing a session an alert is generated with the specified sound file.</td>\n</tr>\n</tbody></table>\n</div>\n</div>\n            \n\n          ",
  "url": "https://help.atas.net/en/support/solutions/articles/72000602465-session-color",
  "scrapedAt": "2025-10-20T22:24:42.693Z"
}