{
  "title": "Tape patterns",
  "content": "\n            <div><div>\nThe indicator is designed to process and filter “raw” order stream, flowing into the market. It has very sensitive settings to compute different automatic download algorithms and positions unloading.<br>Here are a few things Tape Patterns will enable you to do:<br>- You will be able to detect max and min volume in the current prints chain<br>- You will be able to use this volume to filter<br>- You will be able to see time in milliseconds between the desired prints<br>- You will see the number of ticks in range<br>- You will be able to detect trade side (buy/sell).<br>The indicator takes into account all this data and displays it on the chart.<br><br>IMPORTANT! To optimize the load on the server, the indicator data is displayed only for the current session.\n</div>\n</div><hr><p><img src=\"https://s3.amazonaws.com/cdn.freshdesk.com/data/helpdesk/attachments/production/72082689154/original/qZhjxIo4udBwGvyRzV61sgbUYkMhXeuBCg.png?1706113823\"></p><p>To add and set up the indicator, open the <a href=\"https://help.atas.net/en/support/solutions/articles/72000602613\">Indicators settings window</a>.</p><p><br></p><h2>Indicator's settings<em><br></em></h2><div><div>\n<h3>Time filtration</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Use time filter</td>\n<td>This setting enables the application of a time-based filter for the indicator. When activated, the indicator will only analyze and display data for candles that fall within a specified time range. If turned off, the indicator considers candles from all time frames.</td>\n</tr>\n<tr>\n<td>Time from</td>\n<td>This parameter sets the starting time for the time filter.</td>\n</tr>\n<tr>\n<td>Time to</td>\n<td>This parameter establishes the end time for the time filter.</td>\n</tr>\n</tbody></table>\n<h3>Calculation</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Cumulative Trades</td>\n<td>A mode in which only cumulative transactions are used in calculations.</td>\n</tr>\n<tr>\n<td>Min Print Volume</td>\n<td>Volumes that are less than the value set in this filter will be ignored.</td>\n</tr>\n<tr>\n<td>Max Print Volume</td>\n<td>Volumes greater than the value set in this filter will be ignored.</td>\n</tr>\n<tr>\n<td>Minimum trades count</td>\n<td>Defines the minimum number of trades allowed for calculation.</td>\n</tr>\n<tr>\n<td>Maximum trades count</td>\n<td>Defines the maximum number of trades allowed for calculation. </td>\n</tr>\n<tr>\n<td>Min Cumulative Volume</td>\n<td>Defines the minimum volume for cumulative trades allowed for calculation.</td>\n</tr>\n<tr>\n<td>Max Cumulative Volume</td>\n<td>Defines the maximum volume for cumulative trades allowed for calculation.</td>\n</tr>\n<tr>\n<td>Time Filter</td>\n<td>Defines the maximum size of the time period for carrying out some calculations.</td>\n</tr>\n<tr>\n<td>Search prints inside time filter</td>\n<td>If activated, the calculation incorporates only cumulative trades where the time span between the conclusion and initiation of the trade does not surpass a predefined duration.</td>\n</tr>\n<tr>\n<td>Range Filter</td>\n<td>Defines the maximum number of price levels for calculation.</td>\n</tr>\n<tr>\n<td>Calculation Mode</td>\n<td>Represents one of the available data source types. <br><br><div>Options: <ul><li><b>Any</b></li><li><b>Bids</b></li><li><b>Ask</b></li><li><b>Between</b></li><li><b>Bid or Ask</b></li><li><b>Bid and Ask</b></li></ul></div></td>\n</tr>\n</tbody></table>\n<h3>Visualization</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Visual Objects Transparency</td>\n<td>Visual Objects Transparency</td>\n</tr>\n<tr>\n<td>Cluster Selection Transparency</td>\n<td>Similar to the visual objects transparency, this setting adjusts the transparency of highlighted elements within clusters, allowing for finer control over their visual appearance.</td>\n</tr>\n<tr>\n<td>Fixed Sizes</td>\n<td>When this option is turned on, all volumes will be displayed with a similar size, regardless of their actual volume. This can be useful for standardizing the visual representation of different volumes on the chart.</td>\n</tr>\n<tr>\n<td>Size</td>\n<td>This parameter sets the standard size for selections on the chart.</td>\n</tr>\n<tr>\n<td>Maximum Size</td>\n<td>Indicates the maximum size for the shape.</td>\n</tr>\n<tr>\n<td>Minimum Size</td>\n<td>Indicates the minimum size for the shape.</td>\n</tr>\n<tr>\n<td>Visual Mode</td>\n<td>The visual mode setting determines how selections are displayed on the chart <br><br><div>Options: <ul><li><b>Ellipse</b></li><li><b>Triangle</b></li><li><b>Rectangle</b></li><li><b>Diamond</b></li><li><b>Only price</b></li></ul></div></td>\n</tr>\n</tbody></table>\n<h3>Colors</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Between color</td>\n<td>Defines the color for elements displaying over-the-counter trades.</td>\n</tr>\n<tr>\n<td>Buys</td>\n<td>Sets the color of the element representing the buy signal.</td>\n</tr>\n<tr>\n<td>Sells</td>\n<td>Sets the color of the element representing the sell signal.</td>\n</tr>\n</tbody></table>\n<h3>Alerts</h3>\n<table>\n<tbody><tr><th>Name</th><th>Description</th></tr>\n<tr>\n<td>Use alerts</td>\n<td>Enables or disables the sound notification.</td>\n</tr>\n<tr>\n<td>Alert File</td>\n<td>This parameter allows users to specify the name of a custom audio file for alert sounds. Users can select a WAV file that will be played whenever an alert condition is triggered. The chosen WAV file should be located in the folder C:\\Program Files (x86)\\ATAS Platform\\Sounds.</td>\n</tr>\n</tbody></table>\n</div>\n</div>\n            \n\n          ",
  "url": "https://help.atas.net/en/support/solutions/articles/72000602248-tape-patterns",
  "scrapedAt": "2025-10-20T22:20:03.814Z"
}